_processing/Computer/2014-01-26-whitespace.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Einleitung</a></li>
<li><a href="#sec-2">2. Vergleich mit anderen Methoden</a>
<ul>
<li><a href="#sec-2-1">2.1. farbige Pipes und kein farbiger Hintergrund</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Vorteile</a>
<ul>
<li><a href="#sec-3-1">3.1. In aktuellen Emacs-Versionen inbegriffen</a></li>
<li><a href="#sec-3-2">3.2. verschiedene Farben für verschiedene Indentation-Tiefe</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Nachteile</a>
<ul>
<li><a href="#sec-4-1">4.1. Bugs</a>
<ul>
<li><a href="#sec-4-1-1">4.1.1. langsam für restlichen Whitespace, wenn der Point darübergeht&#x2026;</a></li>
<li><a href="#sec-4-1-2">4.1.2. in Teilen inkompatibel mit org-mode indentation-mode</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Einleitung</h2>
<div class="outline-text-2" id="text-1">
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Vergleich mit anderen Methoden</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> farbige Pipes und kein farbiger Hintergrund</h3>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Vorteile</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> In aktuellen Emacs-Versionen inbegriffen</h3>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> verschiedene Farben für verschiedene Indentation-Tiefe</h3>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Nachteile</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Bugs</h3>
<div class="outline-text-3" id="text-4-1">
</div><div id="outline-container-sec-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> langsam für restlichen Whitespace, wenn der Point darübergeht&#x2026;</h4>
</div>
<div id="outline-container-sec-4-1-2" class="outline-4">
<h4 id="sec-4-1-2"><span class="section-number-4">4.1.2</span> in Teilen inkompatibel mit org-mode indentation-mode</h4>
</div>
</div>
</div>
